Revit 2027 API
BuiltInFailures.AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeError Property
 You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AttemptToConnectNonSlopingElementToSlopedPipeError { get; }
Public Shared ReadOnly Property AttemptToConnectNonSlopingElementToSlopedPipeError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AttemptToConnectNonSlopingElementToSlopedPipeError {
	FailureDefinitionId^ get ();
}
static member AttemptToConnectNonSlopingElementToSlopedPipeError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace